# ColumnBaseAttachCutParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ColumnBaseAttachCutParam Property
ParameterTypeId Class See Also
---
"Base Attachment Cut"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ColumnBaseAttachCutParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnBaseAttachCutParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColumnBaseAttachCutParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace